Repository: stanercelik/PolySleep
Catalog: watchkitapp Watch App/ViewModels.xcstrings
Source language: en
Languages: de, ja, ms, th, tr

source: Adaptation Phase
de: Anpassungsphase
ja: 適応段階
ms: Fasa Adaptasi
th: ระยะการปรับตัว
tr: Uyum Fazı

# adaptation_started
source: Schedule adaptation has started
de: Programmanpassung hat begonnen
ja: プログラム適応が始まりました
ms: Adaptasi program telah bermula
th: การปรับตัวของโปรแกรมเริ่มแล้ว
tr: Program adaptasyonu başladı

# adaptation_starting
source: Adaptation process starting...
de: Anpassungsprozess beginnt...
ja: 適応プロセスが開始されています...
ms: Proses adaptasi bermula...
th: กระบวนการปรับตัวกำลังเริ่มต้น...
tr: Adaptasyon süreci başlıyor...

source: Beginning Phase
de: Anfangsphase
ja: 開始段階
ms: Fasa Permulaan
th: ระยะเริ่มต้น
tr: Başlangıç Fazı

# body_adapting_description
source: Body is starting to adapt to the new sleep pattern
de: Der Körper beginnt sich an den neuen Schlafrhythmus zu gewöhnen
ja: 体が新しい睡眠パターンに慣れ始めています
ms: Badan mula menyesuaikan diri dengan corak tidur baharu
th: ร่างกายเริ่มปรับตัวกับรูปแบบการนอนใหม่
tr: Vücut yeni uyku düzenine alışmaya başlıyor

source: Loading adaptation data...
de: Anpassungsdaten werden geladen...
ja: 適応データを読み込み中...
ms: Memuatkan data adaptasi...
th: กำลังโหลดข้อมูลการปรับตัว...
tr: Adaptasyon verisi yükleniyor...

source: ❌ Loading error
de: ❌ Ladefehler
ja: ❌ 読み込みエラー
ms: ❌ Ralat memuatkan
th: ❌ ข้อผิดพลาดในการโหลด
tr: ❌ Yükleme hatası

# next_sleep_hours_minutes
source: Next sleep: %lldh %lldmin
de: Nächster Schlaf: %llds %lldmin
ja: 次の睡眠: %lld時間%lld分
ms: Tidur seterusnya: %lldj %lldmin
th: การนอนครั้งต่อไป: %lldชม. %lldนาที
tr: Sonraki uyku: %llds %llddk

# next_sleep_minutes
source: Next sleep: %lldmin
de: Nächster Schlaf: %lldmin
ja: 次の睡眠: %lld分
ms: Tidur seterusnya: %lldmin
th: การนอนครั้งต่อไป: %lldนาที
tr: Sonraki uyku: %llddk

source: Next sleep not found
de: Nächster Schlaf nicht gefunden
ja: 次の睡眠が見つかりません
ms: Tidur seterusnya tidak ditemui
th: ไม่พบการนอนครั้งต่อไป
tr: Sonraki uyku bulunamadı

# quality_average
source: Average
de: Durchschnittlich
ja: 普通
ms: Sederhana
th: ปานกลาง
tr: Orta

# quality_bad
source: Bad
de: Schlecht
ja: 悪い
ms: Buruk
th: แย่
tr: Kötü

# quality_excellent
source: Excellent
de: Ausgezeichnet
ja: 優秀
ms: Cemerlang
th: ยอดเยี่ยม
tr: Mükemmel

# quality_good
source: Good
de: Gut
ja: 良い
ms: Baik
th: ดี
tr: İyi

# quality_very_bad
source: Very Bad
de: Sehr schlecht
ja: とても悪い
ms: Sangat Buruk
th: แย่มาก
tr: Çok Kötü

source: ❌ Save error
de: ❌ Speicherfehler
ja: ❌ 保存エラー
ms: ❌ Ralat menyimpan
th: ❌ ข้อผิดพลาดในการบันทึก
tr: ❌ Kayıt hatası

# schedule_loading
source: Loading schedule...
de: Programm wird geladen...
ja: スケジュールを読み込み中...
ms: Memuatkan jadual...
th: กำลังโหลดตารางเวลา...
tr: Program yükleniyor...

source: Schedule not found
de: Programm nicht gefunden
ja: スケジュールが見つかりません
ms: Jadual tidak ditemui
th: ไม่พบตารางเวลา
tr: Program bulunamadı

source: Sleep blocks not found
de: Schlafblöcke nicht gefunden
ja: 睡眠ブロックが見つかりません
ms: Blok tidur tidak ditemui
th: ไม่พบช่วงการนอน
tr: Uyku blokları bulunamadı

# sleep_entry_saved
source: ✅ Sleep quality saved
de: ✅ Schlafqualität gespeichert
ja: ✅ 睡眠の質が保存されました
ms: ✅ Kualiti tidur disimpan
th: ✅ คุณภาพการนอนถูกบันทึกแล้ว
tr: ✅ Uyku kalitesi kaydedildi

# sleep_time_now
source: Sleep time!
de: Schlafzeit!
ja: 睡眠時間です！
ms: Masa tidur!
th: ถึงเวลานอน!
tr: Uyku zamanı!

source: 📱 Synchronizing...
de: 📱 Synchronisierung...
ja: 📱 同期中...
ms: 📱 Menyegerakkan...
th: 📱 กำลังซิงค์...
tr: 📱 Senkronize ediliyor...

source: Waiting for connection...
de: Warten auf Verbindung...
ja: 接続を待機中...
ms: Menunggu sambungan...
th: รอการเชื่อมต่อ...
tr: Bağlantı bekleniyor...

source: Waiting for data...
de: Daten werden erwartet...
ja: データを待機中...
ms: Menunggu data...
th: รอข้อมูล...
tr: Veri bekleniyor...

source: 📱 Waiting for iOS...
de: 📱 Warten auf iOS...
ja: 📱 iOSを待機中...
ms: 📱 Menunggu iOS...
th: 📱 รอ iOS...
tr: 📱 iOS'tan bekleniyor...

source: 📱 Waiting for iOS data...
de: 📱 Warten auf iOS-Daten...
ja: 📱 iOSデータを待機中...
ms: 📱 Menunggu data iOS...
th: 📱 รอข้อมูล iOS...
tr: 📱 iOS'tan data bekleniyor...
